<a href="https://colab.research.google.com/github/piyush-no1/aims_assignment_1-/blob/main/aims_done.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
df=pd.read_csv('aboutus.csv')

In [2]:
#Ordinal ENcoding

df['Specialization_encoded'] = df['Specialization'].map({'Data Science & Analytics':1, 'Software Development':2, 'Finance & Investment':3, 'Design & Creative Media':4})
df

       Name  Age             Specialization  Specialization_encoded
0      Aman  18.0  Data Science & Analytics                       1
1    Madhav  25.0      Software Development                       2
2  Himanshu  26.0      Finance & Investment                       3
3     Ayush  29.0   Design & Creative Media                       4
4    Rahul    NaN      Software Development                       2
5   Rishabh  24.0      Finance & Investment                       3
6     Vikas  27.0  Data Science & Analytics                       1
7      Appu  21.0      Finance & Investment                       3
8    Mukesh  25.0   Design & Creative Media                       4
9     Venky  50.0      Software Development                       2

In [3]:
#Onehot Encoding
spz=df['Specialization']
unq=[]
for x in spz:
  if x in unq:
    pass
  else:
    unq.append(x)
print(unq)
for sp in unq:
    df[sp] = df['Specialization'].map(lambda x: 1 if x == sp else 0)
df

['Data Science & Analytics', 'Software Development', 'Finance & Investment', 'Design & Creative Media']

,Name,Age,Specialization,Specialization_encoded,Data Science & Analytics,Software Development,Finance & Investment,Design & Creative Media
0,Aman,18.0,Data Science & Analytics,1,1,0,0,0
1,Madhav,25.0,Software Development,2,0,1,0,0
2,Himanshu,26.0,Finance & Investment,3,0,0,1,0
3,Ayush,29.0,Design & Creative Media,4,0,0,0,1
4,Rahul,NaN,Software Development,2,0,1,0,0
5,Rishabh,24.0,Finance & Investment,3,0,0,1,0
6,Vikas,27.0,Data Science & Analytics,1,1,0,0,0
7,Appu,21.0,Finance & Investment,3,0,0,1,0
8,Mukesh,25.0,Design & Creative Media,4,0,0,0,1
9,Venky,50.0,Software Development,2,0,1,0,0

In [4]:
imp_col = [col for col in df.columns if df[col].isnull().any()]
print(imp_col)

['Age ']

In [5]:
#imputation

total=0
ct=0
for x in df['Age ']:
  if x!=x:
    pass
  else:
    total=total+x
    ct=ct+1
mean_age=total/ct
print(mean_age)

df['Age '] = df['Age '].fillna(mean_age)
df

27.22222222222222

,Name,Age,Specialization,Specialization_encoded,Data Science & Analytics,Software Development,Finance & Investment,Design & Creative Media
0,Aman,18.000000,Data Science & Analytics,1,1,0,0,0
1,Madhav,25.000000,Software Development,2,0,1,0,0
2,Himanshu,26.000000,Finance & Investment,3,0,0,1,0
3,Ayush,29.000000,Design & Creative Media,4,0,0,0,1
4,Rahul,27.222222,Software Development,2,0,1,0,0
5,Rishabh,24.000000,Finance & Investment,3,0,0,1,0
6,Vikas,27.000000,Data Science & Analytics,1,1,0,0,0
7,Appu,21.000000,Finance & Investment,3,0,0,1,0
8,Mukesh,25.000000,Design & Creative Media,4,0,0,0,1
9,Venky,50.000000,Software Development,2,0,1,0,0